# Brewfile for fresh Mac installs
# Run with: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Core utilities
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gawk"

# Development tools
brew "git"
brew "gh"                   # GitHub CLI
brew "curl"
brew "wget"
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor

# Shell tools
brew "zsh"
brew "zsh-completions"
brew "bash"
brew "bash-completion@2"
brew "tmux"
brew "screen"

# Modern replacements for standard tools
brew "bat"                  # Better cat
brew "exa"                  # Better ls
brew "fd"                   # Better find
brew "ripgrep"              # Better grep
brew "fzf"                  # Fuzzy finder
brew "htop"                 # Better top

# Version managers
brew "nvm"                  # Node version manager
brew "pyenv"                # Python version manager
brew "rbenv"                # Ruby version manager

# Programming languages
brew "python@3.11"
brew "node"
brew "go"

# Text editors
brew "vim"
brew "neovim"

# Applications (Casks)
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "rectangle"            # Window management
cask "alfred"               # Spotlight replacement
cask "1password"            # Password manager

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
